---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberSectionType
source: html/205448e3-4201-a9e4-dba2-75b44b3e5c73.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberSectionType Property

"Section Type": The id of the type from the structural Family assigned to the analytical member.

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalMemberSectionType { get; }
```